[Killed] Equality mutation
Code/GeneralClass.cs:22:17
         
         public int DevideTwoNumbers(int a, int b)
         {
-            if (b == 0) throw new DivideByZeroException();
+            if (b != 0) throw new DivideByZeroException();
 
             return a / b;
killedBy: ConsoleApp1.__Tests__.GeneralTests.TestDevideTwoNumbers(1,1,1); ConsoleApp1.__Tests__.GeneralTests.TestDevideTwoNumbers(2,2,1)

[Survived] Statement mutation
Code/GeneralClass.cs:22:25
         
         public int DevideTwoNumbers(int a, int b)
         {
-            if (b == 0) throw new DivideByZeroException();
+            if (b == 0) ;
 
             return a / b;
